app/controllers/quotations_controller.rb

    def set_quotation
      @quotation = Quotation.find(params[:id])
---
SELECT "quotations".* FROM "quotations" WHERE "quotations"."id" = ? LIMIT 1  [["id", "980190962"]]